## Welcome to your notebook.

#### Run this cell to connect to your GIS and get started:

In [ ]:
from arcgis.gis import GIS
gis = GIS("home")

#### Now you are ready to start!

In [67]:
import numpy as np
import pandas as pd

In [16]:
df = pd.read_csv('/arcgis/home/portland_park_trees.csv')
#import data

In [32]:
df.head()

,fid,OBJECTID,Inventory_,Species,DBH,Condition,TreeHeight,CrownWidth,CrownWid_1,CollectedB,...,Genus,Common_nam,Genus_spec,Functional,Size,Native,Edible,Nuisance,Origin,Species_fa
0,1,426,2017/05/09,PSME,37.4,Fair,105.0,44.0,57.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
1,2,427,2017/05/09,PSME,32.5,Fair,94.0,49.0,45.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...
2,3,428,2017/05/09,CRLA,9.7,Fair,23.0,28.0,27.0,staff,...,Crataegus,Lavalle hawthorn,Crataegus x lavalleei,BD,S,No,NaN,NaN,North America - a hybrid between a Mexican and...,"Like most hawthorns, the tree has stout thorns..."
3,4,429,2017/05/09,QURU,10.3,Poor,28.0,38.0,31.0,staff,...,Quercus,northern red oak,Quercus rubra,BD,L,No,NaN,NaN,North America - eastern Canada and eastern USA...,Acorns take two years to mature and are an imp...
4,5,430,2017/05/09,PSME,33.2,Fair,102.0,43.0,44.0,staff,...,Pseudotsuga,Douglas-fir,Pseudotsuga menziesii,CE,L,Yes,NaN,NaN,North America - from British Columbia south to...,Bracts on cones look like a mouse's feet and t...

##### Question 1: how many trees are of the Quercus or Acer genus?

In [38]:
Acer_Quercus = df.query('Genus=="Acer"'or 'Genus=="Quercus"') #create a query using pandas to subset only the required secies

print(len(Acer_Quercus)) #print the number of rows in this query

3586

##### Question 2: How many trees are of the quercus or Acer genus and have a DBH larger than 50 inches?

In [39]:
q2 = Acer_Quercus.query('DBH>50') #query the dataframe defined previously to only include rows where DBH is larger than 50
print(len(q2)) #print the number of rows in this query

44

##### Question 3: Which genus has the highest mean DBH of the following genera: Quercus, Acer, or Fraxinus?

In [49]:
Quercus = df.query('Genus=="Quercus"') #create a subset of only the specific tree
Quercus_mean = Quercus["DBH"].mean() #calculate mean
print(Quercus_mean)

#repeat for the other genera

Acer = df.query('Genus=="Acer"')
acer_mean = Acer["DBH"].mean()
print(acer_mean)

Fraxinus = df.query('Genus=="Fraxinus"')
Fraxinus_mean = Fraxinus["DBH"].mean()
print(Fraxinus_mean)

print(" ")
print("Quercus has the largest mean")

23.56823839157492
18.419085331846066
11.033609693877551

Quercus has the largest mean

##### Question 4: How many different species of trees are recorded in the Acer genus?

acer = df.query('Genus=="Acer"') #create query for only acer trees
new_acer = acer['Species'] #combine this with species row to create a new dataframe

unique = new_acer.unique() #unique finds the number of variables that are unique in the species column
print(len(unique)) #print the number of unique species

##### Question 5: 
##### â€¢ Calculate a new column named "pop_M" (population in millions), by transforming the "pop" (population) column.
##### â€¢ Remove the original "pop" column.
##### â€¢ Choose/subset a city that starts with the same letter as your first name (for example, "Mexico City" if your first name is Michael).
##### â€¢ Subset the five biggest (i.e., largest population sizes) cities from the country where your selected city is.
##### â€¢ Print the result.
##### â€¢ Make sure you write the scripts in different code cells where you describe the process.

In [62]:
cities = pd.read_csv('/arcgis/home/world_cities.csv', index_col=0) #import the data set

cities.head() #preview the first 5 cities

                      country    pop    lat    lon  capital
city
'Abasan al-Jadidah  Palestine   5629  31.31  34.34        0
'Abasan al-Kabirah  Palestine  18999  31.32  34.35        0
'Abdul Hakim         Pakistan  47788  30.55  72.11        0
'Abdullah-as-Salam     Kuwait  21817  29.36  47.98        0
'Abud               Palestine   2456  32.03  35.07        0

##### â€¢ Calculate a new column named "pop_M" (population in millions), by transforming the "pop" (population) column.

In [73]:
cities['pop_M'] = cities["pop"]/1000000
#add a column to the cities dataframe that is the population in millions

cities.head()
#check that this has worked

                      country    pop    lat    lon  capital     pop_M
city
'Abasan al-Jadidah  Palestine   5629  31.31  34.34        0  0.005629
'Abasan al-Kabirah  Palestine  18999  31.32  34.35        0  0.018999
'Abdul Hakim         Pakistan  47788  30.55  72.11        0  0.047788
'Abdullah-as-Salam     Kuwait  21817  29.36  47.98        0  0.021817
'Abud               Palestine   2456  32.03  35.07        0  0.002456

##### â€¢ Remove the original "pop" column.

In [83]:
cities.pop('pop')  #delete the column
cities.head()

                      country    lat    lon  capital     pop_M
city
'Abasan al-Jadidah  Palestine  31.31  34.34        0  0.005629
'Abasan al-Kabirah  Palestine  31.32  34.35        0  0.018999
'Abdul Hakim         Pakistan  30.55  72.11        0  0.047788
'Abdullah-as-Salam     Kuwait  29.36  47.98        0  0.021817
'Abud               Palestine  32.03  35.07        0  0.002456

##### â€¢ Choose/subset a city that starts with the same letter as your first name (for example, "Mexico City" if your first name is Michael).

In [94]:
Mixco = cities.query('city=="Mixco"') #This is the subset for only Milan
print(Mixco)

         country    lat   lon  capital     pop_M
city
Mixco  Guatemala  14.64 -90.6        0  0.505879

In [101]:
guatemala = cities.query('country=="Guatemala"') #create a subset for Guatemala cities

guatemala_sorted = guatemala.sort_values(by='pop_M', ascending=False) 
#sort the rows so they appear in the order of highest to lowest population

guatemala_sorted.head(5)
#print the first 5 rows (the 5 highest values)

                         country    lat    lon  capital     pop_M
city
Guatemala              Guatemala  14.63 -90.55        1  1.010253
Mixco                  Guatemala  14.64 -90.60        0  0.505879
Villa Nueva            Guatemala  14.53 -90.59        0  0.450366
San Juan Sacatepequez  Guatemala  14.72 -90.64        0  0.164981
Petapa                 Guatemala  14.50 -90.57        0  0.163174